{
  "policy": {
    "actions": [
      {
        "category": 3,
        "type": "event"
      },
      {
        "enabled": true,
        "id": 23513,
        "type": "notification"
      }
    ],
    "conditions": [
      {
        "analytic": "baselineDeviation",
        "metric": "netuitive.aws.ebs.averagelatency",
        "operator": ">"
      },
      {
        "analytic": "baselineDeviation",
        "metric": "netuitive.aws.ebs.queuelengthdifferential",
        "operator": ">"
      },
      {
        "analytic": "actual",
        "level": 1,
        "metric": "netuitive.aws.ebs.queuelengthdifferential",
        "operator": ">"
      },
      {
        "analytic": "actual",
        "level": 8,
        "metric": "cpu.total.iowait",
        "operator": ">"
      }
    ],
    "deleted": false,
    "description": "This policy looks at two Netuitive computed metrics: Queue Length Differential, and Average Latency. Average Latency is straightforward, representing the average amount of time that it takes for a disk operation to complete. Queue Length Differential measures the difference between the actual disk queue length and the \"ideal\" disk queue length. The ideal queue length is based on Amazon's rule of thumb that for every 200 IOPS you should have a queue length of 1. In theory, a well-optimized volume should have a queue length differential that tends to hover around 0. In practice, we have seen volumes with extremely low latency (< 0.0001) have queue length differentials that are higher than 0; presumably this is because the latency is much lower than Amazon is assuming for their rule of thumb. Even in these cases, the differential is a pretty steady number.\n\nThis policy also looks at the effect the latency has on the instance itself. If the cpu total i/o wait is greater than 8%, you could see adverse affects on the underlying software. In this case, you may need to do one of the following:\n* Increase the provision IOPS of the ebs volume\n* Scale out the service if it is clustered\n* Consider a RAID if this is a long term issue\n* Consider an instance class that provides faster volumes if this is a long term issue\n\nFor more information, please refer to our blog entry: http://www.netuitive.com/detecting-performance-issues-on-ebs-volumes/",
    "duration": 1800,
    "enabled": true,
    "name": "AWS EBS - Elevated Queue Length Differential with Critical Latency",
    "scope": {
      "elementTypes": [
        "EBS"
      ]
    }
  }
}